app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    if @project.save
---
INSERT INTO `projects` (`created_at`, `customer`, `description`, `isComplete`, `price`, `title`, `updated_at`) VALUES ('2015-05-09 23:04:03', 'gra', 'gra', 0, 1, 'gra', '2015-05-09 23:04:03')

  def update
    @project = Project.find(params[:id])

    if @project.update(project_params)
---
SELECT  `projects`.* FROM `projects`  WHERE `projects`.`id` = 8 LIMIT 1
UPDATE `projects` SET `description` = 'You gotta do all manner of stuff to get an ember app to work with a rails api when Chrome is your browser', `isComplete` = 1, `price` = 0, `updated_at` = '2015-04-29 02:37:09' WHERE `projects`.`id` = 5

  def destroy
    @project.destroy
---
DELETE FROM `projects` WHERE `projects`.`id` = 21

    def set_project
      @project = Project.find(params[:id])
---
SELECT  `projects`.* FROM `projects`  WHERE `projects`.`id` = 21 LIMIT 1